app/controllers/dashboards_controller.rb

  def index
    user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]