app/controllers/logins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def new
    user = User.find_by(id: session[:user_id])