app/controllers/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def new
    user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "joe@email.com"], ["password", "[FILTERED]"], ["created_at", "2022-12-13 01:58:09.308512"], ["updated_at", "2022-12-13 01:58:09.308512"]]
---
  def create
    @user = User.new(user_parms)

    if @user.save